app/controllers/comments_controller.rb

  def index
    @comments = Comment.all
---
SELECT * FROM "comments"

  def create
    @email = Email.find(params[:email_id])
    @comment = @email.comments.create!(params[:comment])
---
SELECT * FROM "emails" WHERE ("emails"."id" = 1)
INSERT INTO "comments" ("name", "created_at", "body", "updated_at", "post_id", "email_id") VALUES('chris', '2010-01-12 23:21:09', 'sdfjnsadf', '2010-01-12 23:21:09', NULL, NULL)