app/controllers/emails_controller.rb

SELECT * FROM "emails"
---
    def emailadmin
     @emails = Email.all

SELECT * FROM "emails" ORDER BY created_at DESC LIMIT 4 OFFSET 0
SELECT count(*) AS count_all FROM "emails"
---
  def index
    @emails = Email.paginate :page => params[:page],
                           :order => 'created_at DESC',
                           :per_page => 8

SELECT * FROM "emails" WHERE ("emails"."id" = 1)
---
  def show
    @email = Email.find(params[:id])

SELECT * FROM "emails" WHERE ("emails"."id" = 1)
---
  def edit
    @email = Email.find(params[:id])

INSERT INTO "emails" ("created_at", "title", "body", "updated_at") VALUES('2010-01-26 00:44:48', 'something', '<p>p{color:red} heyooo</p>', '2010-01-26 00:44:48')
---
  def create
    @email = Email.new(params[:email])

    respond_to do |format|
      if @email.save

SELECT * FROM "emails" WHERE ("emails"."id" = 1)
UPDATE "emails" SET "updated_at" = '2010-01-26 01:10:57', "body" = '<p><img src="http://s3.photobucket.com/albums/y63/cpow85/?action=view&amp;current=therock07.jpg" alt="something" width="100" height="150" /></p>
---
  def update
    @email = Email.find(params[:id])

    respond_to do |format|
      if @email.update_attributes(params[:email])

SELECT * FROM "emails" WHERE ("emails"."id" = 2)
DELETE FROM "emails" WHERE "id" = 2
---
  def destroy
    @email = Email.find(params[:id])
    @email.destroy